# ------------------------------------------------------------
# [실습] 숫자를 입력 받아서 음이 아닌 정수와 음수 구분하기
# ------------------------------------------------------------

num=input("정수를 입력해 주세요").strip()
if num[0] == '-':
    print(f'숫자 {num}은 음수입니다.')
else:
    print(f'숫자 {num}은 음이 아닌 정수입니다.')

num=int(input("정수를 입력해 주세요").strip())
if num>=0:
    print(f'숫자 {num}은 음이 아닌 정수입니다.')
else:
    print(f'숫자 {num}은 음수입니다.')

# ------------------------------------------------------------
# [실습] 점수를 입력 받아서 합격과 불합격 출력
# - 합격 : 60점 이상
# ------------------------------------------------------------
jumsu=int(input('점수를 입력해주세요: '))
if jumsu>=60:
    print('합격!')
else: print('불합격')

# ------------------------------------------------------------
# [실습] 점수를 입력 받아서 학점 출력
# - 학점 : A,B,C,D,F
# ------------------------------------------------------------
jumsu=int(input('점수를 입력해주세요: '))

if jumsu>=90:
    print('A입니다!')
elif jumsu>=80:
    print('B입니다!')
elif jumsu>=70:
    print('C입니다!')
elif jumsu>=60:
    print('D입니다!')
else:
    print('F...')







